use VladBD

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE Пол = 'м' AND Курс <> 1

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE Курс = 4

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE [Год Рождения] > 2010

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE Курс BETWEEN 3 AND 5
ORDER BY [Имя студента] DESC

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE Курс NOT BETWEEN 3 AND 5

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE [Имя студента] IN ('Ирина','Василиса')

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE [Имя студента] LIKE 'В%'
UNION
SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE [Имя студента] LIKE 'Н%'

SELECT [Имя студента], Пол, [Год Рождения], Курс 
FROM Студент
WHERE Пол = 'ж' and [Год Рождения] < 2010
ORDER BY [Имя студента]