use Vova_5

SELECT Город.Название as [Название города], count(*) as 'Кол-во учеников в каждом городе'
FROM Ученик
JOIN Город on Ученик.IDгород = Город.IDгород
Group BY Город.Название
HAVING Город.Название <> 'Гомель'

SELECT ФИО, Пол, Возраст, Город.Название as [Название города]
FROM Ученик
JOIN Город on Ученик.IDгород = Город.IDгород
where Возраст > (SELECT avg(Возраст) from Ученик)

SELECT ФИО, Пол, Возраст, ДатаРождения, Город.Название as [Название города]
FROM Ученик
JOIN Город on Ученик.IDгород = Город.IDгород
where Возраст = (SELECT min(Возраст) from Ученик)

SELECT ФИО, Пол, Возраст, Город.Название as [Название города]
FROM Ученик
JOIN Город on Ученик.IDгород = Город.IDгород
where Возраст = (SELECT max(Возраст) from Ученик)

SELECT Предмет.Название as [Название предмета], КоличествоЧас, ТипПредмета.Название as [Тип предмета]
FROM Предмет
JOIN ТипПредмета on Предмет.IDтп = ТипПредмета.IDтп 
where КоличествоЧас > (SELECT avg(КоличествоЧас) from Предмет)

SELECT ТипПредмета.Название as [Тип предмета], count(*) as 'Кол-во одинаковых типов предмета'
FROM Предмет
JOIN ТипПредмета on Предмет.IDтп = ТипПредмета.IDтп 
Group BY ТипПредмета.Название
HAVING count(*) >= 2 

SELECT Пол, count(*) as 'Кол-во учеников Ж пола'
FROM Выбор
JOIN Ученик on Выбор.IDпаспорт = Ученик.IDпаспорт
Group BY Пол
HAVING Пол <> 'м'

SELECT Предмет.Название as [Название предмета], КоличествоЧас, ДатаВыбора, ОтметкаОВыборе
FROM Выбор
JOIN Предмет on Предмет.IDпредмет = Выбор.IDпредмет
where ОтметкаОВыборе > (SELECT avg(ОтметкаОВыборе) from Выбор)