use Vova_5

SELECT ФИО as [ФИО ученика], Пол, ДатаРождения as [Дата Рождения], Возраст, IDпаспорт as [№ Паспорта]
FROM Ученик 
WHERE Возраст >= 18
ORDER BY ФИО

SELECT ФИО as [ФИО ученика], Пол, ДатаРождения as [Дата Рождения], Возраст, IDпаспорт as [№ Паспорта]
FROM Ученик 
WHERE Пол = 'Ж'
ORDER BY ДатаРождения DESC

SELECT ФИО as [ФИО ученика], ДатаРождения as [Дата Рождения], Возраст
FROM Ученик 
WHERE ДатаРождения NOT BETWEEN '2000-11-01' AND '2002-06-30'

SELECT ФИО as [ФИО ученика], Пол, ДатаРождения as [Дата Рождения], Возраст, IDпаспорт as [№ Паспорта]
FROM Ученик 
WHERE ДатаРождения IN ('2004-04-23','2000-11-01', '2005-01-10', '2001-08-21')
ORDER BY Возраст

SELECT ФИО as [ФИО ученика], IDпаспорт as [№ Паспорта]
FROM Ученик 
WHERE ФИО LIKE 'К%'
UNION
SELECT ФИО as [ФИО ученика], IDпаспорт as [№ Паспорта]
FROM Ученик 
WHERE ФИО LIKE 'Ю%'

SELECT ФИО as [ФИО ученика], Пол, ДатаРождения as [Дата Рождения], Возраст
FROM Ученик 
WHERE Возраст <> 15 AND Пол ='М'

SELECT ФИО as [ФИО ученика], ДатаРождения as [Дата Рождения], Возраст
FROM Ученик 
WHERE ДатаРождения > '2002-01-01' OR Возраст = 18
ORDER BY Возраст DESC

SELECT ФИО as [ФИО ученика], Пол, Возраст
FROM Ученик 
WHERE Возраст > 15 AND Возраст < 18